/***************************************************************************
* 独立按键的初始化及其功能函数
*
* 文 件: key.h
* 作 者: CJW
* 说 明：独立按键的初始化及其功能函数
* 编写时间: 2016.7.20
* 版 本：1.0
* 修改日期： 无
 
*---------------------------------------------------------------------------
* 注: //00表示没有按键
			//01表示按键1
			//02表示按键2
			//04表示按键3
			//08表示按键4
			//10表示按键5 
*****************************************************************************/
#ifndef __KEY_H
#define __KEY_H
#include "HC89F303.h" 
/* Includes ------------------------------------------------------------------------------------------------*/
 
 
  
      
/*****************************硬件I/O引脚定义,根据实际应用修改******************************/
 
sbit key_1 = P3^5;
sbit key_2 = P2^4;
sbit key_3 = P0^2;

extern ux8 config_rf_flag  ;   //配网标志为1时,把地址码写入eeprom;
extern ux8 receive_rf_flag;   //配对时接收到433按键码,该标志置一,此时接收板按下按键,该标志清零;15s内没有配码,该标志也清零
extern ux8 key_code;          //配对时接收到433按键码,码值临时存储在这个变量里面;15s内没有配码,该变量也清零
extern u8 KEY1,KEY2,KEY3; 



 

#define K_NO         0x00          // "无"键

#define K_1         0x10          // "无"键
#define K_2         0x20          // "+ "键
#define K_3         0x40          // "- "键
#define K_Power      0x04          // "电源"键
#define K_Back       0x08          // "返回"键
#define K_Enter      0x01          // "确认"键
#define SETUP        (K_Up |K_Down) // "配置"键
#define K_Long       0x99          // "长按"键

#define OneKeyTime2s      100       // 单键长按时长 = OneKeyTime2s * 10ms
#define OneKeyTime        300       // 单键长按时长 = OneKeyTime * 10ms
#define MuxKeyTime        300       // 组合键长按时长 = MuxKeyTime * 10ms
#define RepeatTime        10        // 单键连发功能重复间隔时间 = RepeatTime * 10ms 

//#define Key_Mask        (K_STOP|K_START|K_SEL|K_ADD|K_DEC)                        // 按键掩码值

//-------------------------------------------------------------------------------------------------------
//#define GetKey()        (KEY_PORT & Key_Mask)                                                // 读取按键端口值

#define key_state_0        0            // 初始态.
#define key_state_1        1            // 确认态.
#define key_state_2        2            // 组合键,长按键确认态.
#define key_state_3        3            // 长按连发功能确认态.
#define key_state_4        4            // 等待释放态.


/****************************************数据类型定义**************************************/
 


/*****************************************函数声明****************************************/
 u8 Get_Key(void) ;                   //读取触摸按键码值                                                                  
 u8 Read_Key(void);										//读取按键.                                        
void  Check_Key(void);
//-------------------------------------------------------------------------------------------------------
#endif



