/******************* (C) COPYRIGHT 2009~2019 holychip **************************
* File Name          : HC89F30x_GeneralKey_Touch_Filter.h
* Author             : Touch Team
* Version            : V1.0.5.0    
* Date               : 2019/10/01
********************************************************************************

注：凡是HCTouchLib开头的宏定义，用户可以根据实际调试需要，修改后面的数据

*******************************************************************************/
#ifndef __HC89F30x_GeneralKey_Touch_Filter_H__
#define __HC89F30x_GeneralKey_Touch_Filter_H__


/****************************************************************************************************/
void TouchRawDataFilter(void);		//触摸RawData滤波函数，此函数必须添加在main.c中，否则程序无法正常运行
/****************************************************************************************************/

// 设置RawData滤波深度，打开后系统会对RawData采用递推中位值平均滤波，即对递推数组进行排序后去除最高值和最低值，然后对剩余数据计算平均值
//			0：关闭滤波功能
//			3->15：设置滤波数组长度，如设置为5，则对RawData数据进行排序，然后去除最高值和最低值，剩余的3个数据计算平均得到最终值
#define HCTouchLib_FILTER_DEPTH					0
/****************************************************************************************************/

#endif

/******************************************************************************************************
 * Revision history:
 *
 * Revision 1.01  	2017/12/18 14:10 Taboo.Z
 * Revision 1.0.2.0	2018/07/20 16:31 Jing.L
 * Revision 1.0.3.0	2018/09/10 14:38 Jing.L
 * Revision 1.0.4.0	2019/03/06 13:59 Touch Team
 * Revision 1.0.5.0	2019/09/17 19:23 Touch Team
 * Add: 1、首次增加RawData滤波功能
 ******************************************************************************************************/